package studyClass;

public class Other {

	
	/** 추상클래스와 인터페이스의 공통점
	 * 하위 클래스에서 특정한 행등을 강제하기 위해서 사용 
	 */
	
	/** 추상클래스와 인터페이스의 차이점
	 * 1.상속
	 * 추상클래스 : 한 클래스는 하나의 클래스만 상속
	 * 인터페이스 : 한 클래스는 여러 인터페이스를 구현 가능
	 * 
	 * 2.멤버 변수 
	 * 추상 클래스 : 멤버 변수를 가질 수 있다.
	 * 인터페이스 : 상수만 포함가능
	 * 
	 * 3.구성 요소
	 * 추상 클래스 : 추상 매서드, 생성자, 변수, 일반 매서드
	 * 인터페이스 : 추상 매서드 , 상수, 디폴트 매서드
	 * 
	 * 4.사용
	 * 추상클래스 : 상속 관계에서 공통의 기능이나 상태를 유지할 때 사용
	 * 인터페이스 : 여러 클래스에서 공통으로 필요한 기능을 정의할 때 사용
	 * 
	 * 5.생성자
	 * 추상클래스 : 생성자와 초기화 가능
	 * 인터페이스 : 생성자와 초기화 불가능
	 * 
	 */
	

	
}
